Repository: pingfangx/TranslatorX-other
Catalog: miscellaneous/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: When retrying pipelined requests after a failed connection (a connection not explicitly closed by the server in its last complete response), a client MUST NOT pipeline immediately after connection establishment, since the first remaining request in the prior pipeline might have caused an error response that can be lost again if multiple requests are sent on a prematurely closed connection (see the TCP reset problem described in Section 6.6).
zh_cn: 在连接失败后重新连接流水线请求(服务器在其上一个完整响应中未明确关闭的连接)，客户端必须在连接建立后不立即进行流水线，因为先前流水线中的第一个剩余请求可能导致错误响应如果在过早关闭的连接上发送多个请求，则可能会再次丢失(请参阅第 6.6 节中描述的 TCP 重置问题)。

source: When sending a HelloRetryRequest, the server MAY provide a "cookie" extension to the client (this is an exception to the usual rule that the only extensions that may be sent are those that appear in the ClientHello).
zh_cn: 发送 HelloRetryRequest 时，服务器可以向客户端提供“cookie”扩展(这是通常规则的例外，即通常只可以发送 ClientHello 中出现的扩展)。

source: When sending data to older HTTP applications, implementations SHOULD only use media type parameters when they are required by that type/subtype definition.
zh_cn: 当向旧的 HTTP 应用程序发送数据时，实现只应在该类型/子类型定义需要时使用媒体类型参数。

source: When sending the new ClientHello, the client MUST copy the contents of the extension received in the HelloRetryRequest into a "cookie" extension in the new ClientHello.
zh_cn: 发送新的 ClientHello 时，客户端必须将 HelloRetryRequest 中收到的“cookie”扩展内容复制到新 ClientHello 中的“cookie”扩展名中。

source: When sent by the client, the "supported_groups" extension indicates the named groups which the client supports for key exchange, ordered from most preferred to least preferred.
zh_cn: 当客户端发送时，“supported_groups”扩展表示客户端支持密钥交换的命名组，从最优先选择到最不优先。

source: When sent, it MUST immediately follow the client key exchange message.
zh_cn: 发送时，它必须紧跟客户端密钥交换消息。

source: When sent, this message MUST appear immediately after the Certificate message and immediately prior to the Finished message.
zh_cn: 发送时，此消息必须紧接在 Certificate 消息之后，并且紧接 Finished 消息。

source: When simultaneous attempt occurs, each TCP receives a "SYN" segment which carries no acknowledgment after it has sent a "SYN".
zh_cn: 当同时尝试发生时，每个 TCP 都会收到一个“SYN”报文段，在发送“SYN”后，该报文段不包含确认信息。

source: When the "chunked" transfer- coding is used, it MUST be the last transfer-coding applied to the message-body.
zh_cn: 当使用“分块”传输编码时，它必须是应用于消息体的最后一个传输编码。

source: When the SYN arrives at line 3, TCP B, being in a synchronized state, and the incoming segment outside the window, responds with an acknowledgment indicating what sequence it next expects to hear (ACK 100).
zh_cn: 当 SYN 到达第 3 行时，处于同步状态的 TCP B 和窗口外的传入报文段响应确认，指示接下来希望听到的序列(ACK 100)。

source: When the TCP is up again, A is likely to start again from the beginning or from a recovery point.
zh_cn: 当 TCP 再次启动时，A 很可能从开始或从恢复点再次启动。

source: When the TLS handshake has finished.
zh_cn: TLS 握手完成后。

source: When the client and server decide to resume a previous session or duplicate an existing session (instead of negotiating new security parameters), the message flow is as follows:
zh_cn: 当客户端和服务器决定恢复先前的会话或复制现有会话(而不是协商新的安全性参数)时，消息流如下：

source: When the client is using an ephemeral Diffie-Hellman exponent, then this message contains the client's Diffie-Hellman public value.
zh_cn: 当客户端使用短暂的 Diffie-Hellman 指数时，此消息包含客户端的 Diffie-Hellman 公共值。

source: When the dataflow runs through asynchronous steps, each step may perform different things with different speed.
zh_cn: 当数据流通过异步步骤时，每个步骤可以以不同的速度执行不同的操作。

source: When the original SYN (pun intended) finally arrives at line 6, the synchronization proceeds normally.
zh_cn: 当原始 SYN(双关语)最终到达第 6 行时，同步正常进行。

source: When the other TCP has both acknowledged the FIN and sent a FIN of its own, the first TCP can ACK this FIN.
zh_cn: 当另一个 TCP 同时确认了 FIN 并发送了自己的 FIN 时，第一个 TCP 可以确认此 FIN。

source: When these are encoded, the actual length precedes the vector's contents in the byte stream.
zh_cn: 对它们进行编码时，实际长度位于字节流中 vector 的内容之前。

source: When this message will be sent:
zh_cn: 此消息的发送时机：

source: When to Encode or Decode
zh_cn: 何时编码或解码

source: When used in certificate signatures, the algorithm parameters MUST be DER encoded.
zh_cn: 在证书签名中使用时，算法参数必须是 DER 编码的。

source: Whenever a transfer-coding is applied to a message-body, the set of transfer-codings MUST include "chunked", unless the message is terminated by closing the connection.
zh_cn: 每当传输编码应用于消息体时，传输编码集必须包括“分块”，除非通过关闭连接终止消息。

source: Whenever an implementation encounters a condition which is defined as a fatal alert, it MUST send the appropriate alert prior to closing the connection.
zh_cn: 每当实现遇到被定义为致命警报的条件时，它必须在关闭连接之前发送适当的警报。

source: Whenever the downstream is not ready to receive values, this operator will drop that elemenet from the sequence.
zh_cn: 每当下游未准备好接收值时，此操作符将从序列中删除元素。

source: Where HkdfLabel is specified as:
zh_cn: 其中 HkdfLabel 指定为：

source: Wherever this construct is used, null elements are allowed, but do not contribute to the count of elements present.
zh_cn: 无论在何处使用此构造，都允许使用 null 元素，但不会对存在的元素数量做出贡献。

source: Whether this entity is considered the "client" or the "server" in this connection.
zh_cn: 此实体是否被视为此连接中的“客户端”或“服务器”。

source: Which looks something like this:
zh_cn: 看起来像这样：

source: While TLS 1.3 is not directly compatible with previous versions, all versions of TLS incorporate a versioning mechanism which allows clients and servers to interoperably negotiate a common version if one is supported by both peers.
zh_cn: 虽然 TLS 1.3 与以前的版本不直接兼容，但所有版本的 TLS 都包含一个版本控制机制，允许客户端和服务器在两个对等方都支持的情况下互操作协商通用版本。

source: While computing the checksum, the checksum field itself is replaced with zeros.
zh_cn: 在计算校验和时，校验和字段本身将替换为零。

source: While in some cases the HTTP protocol allows the client to find out whether truncation took place so that, if it received the complete reply, it may tolerate such errors following the principle to "[be] strict when sending and tolerant when receiving" [RFC1958], often truncation does not show in the HTTP protocol data; two cases in particular deserve special note:
zh_cn: 虽然在某些情况下 HTTP 协议允许客户端查明是否发生了截断，因此，如果收到完整的答复，它可以容忍这样的错误，遵循“发送时严格和接收时容忍”[RFC1958]，经常在 HTTP 协议数据中没有显示截断；特别值得注意的是两个案例：

source: White space is not allowed within the tag and all tags are case- insensitive.
zh_cn: 标签内不允许有空格，所有标签都不区分大小写。

source: White space is only significant in that indentation of continuation lines is used to indicate a rule definition that spans more than one line.
zh_cn: 空白区域的重要意义在于延续行的缩进用于指示跨越多行的规则定义。

source: Whitespace
zh_cn: 空白

source: Why Use Observables?
zh_cn: 为什么要使用 Observables？

source: With the two examples before, the 2.x code can now look like this since `ResourceSubscriber` implements `Disposable` directly:
zh_cn: 使用前面的两个例子，2.x 代码现在看起来像这样，因为 `ResourceSubscriber` 直接实现 `Disposable`：

source: With these additions, ReactiveX harmonizes the Iterable and Observable types.
zh_cn: 通过这些添加，ReactiveX 使得 Iterable 和 Observable 类型保持一致了。

source: With this message, the premaster secret is set, either by direct transmission of the RSA-encrypted secret or by the transmission of Diffie-Hellman parameters that will allow each side to agree upon the same premaster secret.
zh_cn: 利用该消息，通过直接传输 RSA 加密的机密或通过传输 Diffie-Hellman 参数来设置预主密钥，该参数将允许每一方同意相同的预主密钥。

source: Within a given message, a sender MUST NOT generate protocol elements or syntax alternatives that are only allowed to be generated by participants in other roles (i.e., a role that the sender does not have for that message).
zh_cn: 在给定的消息中，发送方不得生成仅允许由其他角色的参与者生成的协议元素或语法备选方案(即，发送方对该消息没有的角色)。

source: Without a specific handler, RxJava defaults to printing the `Throwable`'s stacktrace to the console and calls the current thread's uncaught exception handler.
zh_cn: 如果没有特定的处理程序，RxJava 默认将 `Throwable` 的堆栈跟踪打印到控制台并调用当前线程的未捕获异常处理程序。

source: Without such an assumption, two distinct TCP segments could conceivably be assigned the same or overlapping sequence numbers, causing confusion at the receiver as to which data is new and which is old.
zh_cn: 如果没有这样的假设，可以想象两个不同的 TCP 报文段被分配相同或重叠的序列号，从而导致接收器对哪些数据是新的以及哪些是旧的混淆。

source: Words of *TEXT MAY contain characters from character sets other than ISO-8859-1 [22] only when encoded according to the rules of RFC 2047 [14].
zh_cn: * TEXT 的字只有在符合 RFC 2047 [14] 的规则编码时才包含 ISO-8859-1 [22] 以外的字符集中的字符。

source: Working with this new base reactive type is practically the same as the others as it offers a modest subset of the `Flowable` operators that make sense with a 0 or 1 item sequence.
zh_cn: 使用这种新的基本响应类型实际上与其他类型相同，因为它提供了一个适用于 0 或 1 项序列的 `Flowable` 运算符的适度子集。

source: Write-Through Mandatory
zh_cn: 直写强制性

source: Writing such state machines as `Iterable`s is somewhat complicated (but still easier than writing an `Flowable` for consuming it) and unlike C#, Java doesn't have any support from the compiler to build such state machines by simply writing classically looking code (with `yield return` and `yield break`).
zh_cn: 编写像 `Iterable` 这样的状态机有点复杂(但是比编写一个 `Flowable` 更容易使用它)并且与 C＃不同，Java 没有任何编译器支持通过简单编写经典外观来构建这样的状态机代码(带有 `yield return` 和 `yield break`)。

source: X and Y, respectively, are the binary representations of the x and y values in network byte order.
zh_cn: X 和 Y 分别是网络字节顺序中 x 和 y 值的二进制表示。

source: X509v3 [PKIX] certificate of the peer.
zh_cn: 对等端的 X509v3 [PKIX] 证书。

source: Yc needs to be sent.
zh_cn: Yc 需要发送。

source: Yet another example is `Catch` which was named `onErrorResumeNext`.
zh_cn: 另一个例子是 `Catch`，它命名为 `onErrorResumeNext`。

source: You can also specify a particular Scheduler for the timer to operate on:
zh_cn: 您还可以为要运行的计时器指定特定的 Scheduler：

source: You can also use a version of schedule that delays your action on the given Scheduler until a certain timespan has passed.
zh_cn: 您还可以使用 schedule 的版本，该版本会在给定调度器上延时你的操作，直到超过某个时间跨度。

source: You can call this method to indicate that the Subscriber is no longer interested in any of the Observables it is currently subscribed to.
zh_cn: 您可以调用此方法来指示订阅服务器不再对其当前订阅的任何 Observable 感兴趣。

source: You can extend the class and add your own custom `subscribeActual` behavior to achieve something similar to the 1.x features:
zh_cn: 您可以继承类并添加自己的自定义 `subscribeActual` 行为，以实现类似于 1.x 功能的操作：

source: You can think of the Observable class as a “push” equivalent to Iterable, which is a “pull.” With an Iterable, the consumer pulls values from the producer and the thread blocks until those values arrive.
zh_cn: 您可以将 Observable 类的“推”，视为等同于 Iterable 的“拉”。对于 Iterable，消费者从生产者拉取值，并且线程阻塞直到这些值到达。

source: You have to use `Subject.toSerialized()` and `FlowableProcessor.toSerialized()` instead.
zh_cn: 您必须使用 `Subject.toSerialized()` 和 `FlowableProcessor.toSerialized()` 代替。

source: You may be able to handle an element frequency of 1000 Hz or less with Observable but consider using sampling/debouncing anyway.
zh_cn: 您可以使用 Observable 处理 1000 Hz 或更低的元素频率，但无论如何都要考虑使用 sampling/debouncing。

source: You obtain a Scheduler from the factory methods described in the Schedulers class.
zh_cn: 您可以从 Schedulers 类 中描述的工厂方法获取 Scheduler。

source: You should not use or rely on them in any production code.
zh_cn: 您不应该在任何生产代码中使用或依赖它们。

source: Your observer implements some subset of the following methods:
zh_cn: 你的观察者实现以下方法的某些子集：

source: Zero-length fragments of Application Data MAY be sent, as they are potentially useful as a traffic analysis countermeasure.
zh_cn: 可以发送应用程序数据的零长度片段，因为它们可能用作流量分析对策。

source: Zero-length fragments of Application data MAY be sent as they are potentially useful as a traffic analysis countermeasure.
zh_cn: 可以发送应用程序数据的零长度片段，因为它们可能作为流量分析对策使用。

source: [... data stream switches to HTTP/2.0 with an appropriate response (as defined by new protocol) to the "GET /hello.txt" request ...]
zh_cn: [...数据流切换到带有适当响应的 HTTP/2.0(由新协议定义)到“GET /hello.txt”请求...]

source: [CBCTIME] have demonstrated a timing attack on CBC padding based on the time required to compute the MAC.
zh_cn: [CBCTIME] 已经根据计算 MAC 所需的时间证明了对 CBC 填充的定时攻击。

source: [KPR03] can be used to attack a TLS server that reveals whether a particular message, when decrypted, is properly PKCS#1 formatted, contains a valid PreMasterSecret structure, or has the correct version number.
zh_cn: [KPR03] 可用于攻击 TLS 服务器，该服务器显示特定消息在解密时是否正确 PKCS#1 格式化，包含有效的 PreMasterSecret 结构，或具有正确的版本号。

source: [KPR03] describe some theoretical attacks, and therefore the first construction described is RECOMMENDED.
zh_cn: [KPR03] 描述了一些理论攻击，因此建议使用所描述的第一个构造。

source: [RFC3749] describes compression algorithms for TLS.
zh_cn: [RFC3749] 描述了 TLS 的压缩算法。

source: [RFC6066] and [RFC6961] provide extensions to negotiate the server sending OCSP responses to the client.
zh_cn: [RFC6066] 和 [RFC6961] 提供扩展以协商服务器向客户端发送 OCSP 响应。

source: [] Indicates messages protected using keys derived from [sender]_application_traffic_secret_N.
zh_cn: [] 表示使用从 [sender]_application_traffic_secret_N 派生的密钥保护的消息。

source: [sender] denotes the sending side.
zh_cn: [sender] 表示发送方。

source: `Action1` has been renamed to `Consumer` and `Action2` is called `BiConsumer`.
zh_cn: `Action1` 已重命名为 `Consumer`，`Action2` 被称为 `BiConsumer`。

source: `ActionN` is replaced by the `Consumer<Object[]>` type declaration.
zh_cn: `ActionN` 被 `Consumer<Object[]>` 类型声明所取代。

source: `Flowable` can be tested with `io.reactivex.subscribers.TestSubscriber` whereas the non-backpressured `Observable`, `Single`, `Maybe` and `Completable` can be tested with `io.reactivex.observers.TestObserver`.
zh_cn: `Flowable` 可以使用 `io.reactivex.subscribers.TestSubscriber` 进行测试，而非背压的 `Observable`，`Single`，`Maybe` 和 `Completable` 可以使用 `io.reactivex.observers.TestObserver` 进行测试。

source: `TestSubscriber` has the `test(long initialRequest)` and `test(long initialRequest, boolean cancel)` overloads to specify the initial request amount and whether the `TestSubscriber` should be also immediately cancelled.
zh_cn: `TestSubscriber` 有 `test(long initialRequest)` 和 `test(long initialRequest，boolean cancel)` 重载来指定初始请求数量以及是否应立即取消 `TestSubscriber`。

source: `flatMap` is a powerful operator and helps in a lot of situations.
zh_cn: `flatMap` 是一个功能强大的运算符，可以在很多情况下提供帮助。

source: `just` is great when there is a constant value we'd like to jump-start a sequence.
zh_cn: 当有一个恒定的值我们想要跳过一个序列时，`just` 很棒。

source: `just` won't emit its constant value until requested when it is mapped to the result of the `computeValue`, still called for each subscriber individually.
zh_cn: `just` 在被映射到 `computeValue` 的结果之前被请求时不会发射它的常量值，仍然单独为每个用户调用。

source: a Single passes this method the Throwable that caused the Single to be unable to emit an item
zh_cn: Single 将导致 Single 无法发射项目的 Throwable 传递给此方法

source: a Single passes this method the sole item that the Single emits
zh_cn: Single 将发射的唯一项目传递给此方法

source: a variety of operators that enforce particular flow-control policies
zh_cn: 各种执行特定流量控制策略的操作符

source: a) bit 8 of each octet shall be set to one unless it is the last octet of the identifier octets;
zh_cn: a)每个八位字节的第 8 位应设置为 1，除非它是标识符八位字节的最后一个八位字节；

source: a) bit 8 shall be one;
zh_cn: a)第 8 位应为 1；

source: a) bits 8 and 7 shall be encoded to represent the class of the tag as listed in Table 1;
zh_cn: a)第 8 和第 7 位应编码以表示表 1 中列出的标签类；

source: a) bits 8 and 7 shall be encoded to represent the class of the tag as specified in Table 1;
zh_cn: a)应对第 8 和第 7 位进行编码，以表示表 1 中规定的标签类；

source: a) the definite form (see 8.1.3.3); and
zh_cn: a)确定形式(见 8.1.3.3);和

source: a) use the definite form (see 8.1.3.3) if the encoding is primitive;
zh_cn: a)如果编码是原始的，则使用确定形式(见 8.1.3.3)；

source: a)the request included a TE header field that indicates "trailers" is acceptable in the transfer-coding of the response, as described in section 14.39; or,
zh_cn: a)请求包括一个 TE 首部字段，表示在响应的传输编码中可以接受“trailers”，如第 14.39 节所述；要么，

source: added `amb(ObservableSource...)` overload, 2-9 argument versions dropped
zh_cn: 添加了 `amb(ObservableSource...)` 重载，2-9 个参数的版本被删除了

source: added `concatArrayEager` and `concatArrayEagerDelayError`
zh_cn: 添加 `concatArrayEager` 和 `concatArrayEagerDelayError`

source: added `concatArray` and `concatArrayDelayError`
zh_cn: 添加 `concatArray` 和 `concatArrayDelayError`

source: added `doOnLifecylce` to handle `onSubscribe`, `request` and `cancel` peeking
zh_cn: 添加 `doOnLifecylce` 来处理 `onSubscribe`，`request` 和 `cancel` peeking

source: added `forEachWhile(Predicate<T>, [Consumer<Throwable>, [Action]])` for conditionally stopping consumption
zh_cn: 添加 `forEachWhile(Predicate<T>, [Consumer<Throwable>, [Action]])` 以有条件地停止消费

source: added `fromPublisher`
zh_cn: 添加 `fromPublisher`

source: added `intervalRange()`
zh_cn: 添加 `intervalRange()`

source: added `reduceWith(Callable, BiFunction)` to reduce in a Subscriber-individual manner, returns `Single<T>`
zh_cn: 添加 `reduceWith(Callable, BiFunction)` 以订阅者个人的方式减少，返回 `Single<T>`

source: added `repeatUntil(BooleanSupplier)`
zh_cn: 添加 `repeatUntil(BooleanSupplier)`

source: added `retry(Predicate)`, `retry(int, Predicate)`
zh_cn: 添加了 `retry(Predicate)`，`retry(int，Predicate)`

source: added `retryUntil(BooleanSupplier)`
zh_cn: 添加了 `retryUntil(BooleanSupplier)`

source: added `scanWith(Callable, BiFunction)` to scan in a Subscriber-individual manner
zh_cn: 添加了 `scanWith(Callable, BiFunction)` 来以订阅者个人的方式进行扫描

source: added `startWithArray` to disambiguate
zh_cn: 添加了 `startWithArray` 来消除歧义

source: added `subscribeWith` that returns its input after subscription
zh_cn: 添加了 `subscribeWith`，在订阅后返回其输入

source: added `test()` (returns TestSubscriber subscribed to this) with overloads to fluently test
zh_cn: 添加了 `test()` (返回 TestSubscriber 订阅了这个)，带有重载以流畅地测试

source: added `toFuture`
zh_cn: 添加了 `toFuture`

source: added `toObservable`
zh_cn: 添加了 `toObservable`

source: added overload with `bufferSize`
zh_cn: 添加带 `bufferSize` 的重载

source: added overload with `bufferSize` and `delayError` option, *the custom internal map version didn't make it into RC1*
zh_cn: 添加带有 `bufferSize` 和 'delayerror' 选项的重载，*自定义内部映射版本没有将其转换为 RC1*

source: added overload with `prefetch`
zh_cn: 添加带 `prefetch` 的重载

source: added overload with `prefetch` argument
zh_cn: 添加了带有 `prefetch` 参数的重载

source: added overload with `prefetch` argument, 5-9 source overloads dropped, use `concatArray` instead
zh_cn: 添加带 `prefetch` 参数的重载，删除了 5-9 个源的重载，使用 `concatArray` 代替

source: added overloads with `bufferSize` and `delayError` options
zh_cn: 添加了带有 `bufferSize` 和 `delayError` 选项的重载

source: added overloads with `bufferSize` and `delayErrors` capabilities, disambiguated to `zipArray` and `zipIterable`
zh_cn: 添加带 `bufferSize` 和 `delayErrors` 功能的重载，使用 `zipArray` 和 `zipIterable` 消除歧义

source: added overloads with `prefetch`
zh_cn: 添加带 `prefetch` 的重载

source: added overloads with `prefetch` and `delayErrors` options
zh_cn: 添加了带有 `prefetch` 和 `delayErrors` 选项的重载

source: added overloads with `prefetch`, option to delay till the current ends or till the very end
zh_cn: 添加带 `prefetch` 的重载，可选择延迟到当前结束或直到最后

source: added overloads with option to delay till the current ends or till the very end
zh_cn: 添加了重载，可选择延迟到当前结束或直到最后

source: added varargs overload, added overloads with `bufferSize` argument, `combineLatest(List)` dropped
zh_cn: 添加了可变参数重载，添加了 `bufferSize` 参数的重载，删除了 `combineLatest(List)`

source: advances the Scheduler’s clock forward by a particular amount of time
zh_cn: 将调度器的时钟向前推进一段特定的时间

source: advances the Scheduler’s clock to a particular point in time
zh_cn: 将调度器的时钟提前到特定时间点

source: after a specified delay
zh_cn: 在指定的延迟后

source: after connecting to port 8001 of host "www.example.org".
zh_cn: 在连接到主机“www.example.org”的端口 8001 之后。

source: al, attack and the potential for brute-force attack.
zh_cn: 基于王小云等人研究的攻击以及潜在的暴力攻击

source: allow further customization of the backpressure behavior.
zh_cn: 允许进一步定制背压行为。

source: allows you create a custom operator
zh_cn: 允许创建自定义操作符

source: and emit a number indicating how many items were in the sequence
zh_cn: 并发射一个数字，表示序列中有多少项

source: and emit a single boolean indicating if all of the items pass some test
zh_cn: 并发射一个布尔值，表明项目的 全部 是否通过了一些测试

source: and emit a single boolean indicating if the Observable emitted any item (that passes some test)
zh_cn: 并发射一个布尔值，指示 Observable 是否发射了 任何 项(通过了一些测试)

source: and emit a single boolean indicating if the Observable emitted no items
zh_cn: 并发射一个布尔值，指示 Observable 是否 没有 发射项

source: and emit a single boolean indicating if the sequence is identical to one emitted by a second Observable
zh_cn: 并发射一个布尔值，指示序列是否与第二个 Observable 发射的序列相同

source: and emit the average of all of their values
zh_cn: 并发射所有值的平均值

source: and emit the item with the maximum value
zh_cn: 并发射具有最大值的项目

source: and emit the item with the minimum value
zh_cn: 并发射具有最小值的项目

source: and emit the sum of all of their values
zh_cn: 并发射所有值的总和

source: and emitting all of the items from all of the Observables in whatever order they are received
zh_cn: 按照收到的顺序从所有 Observable 中发射所有项

source: and emitting all of the items from all of the Observables, one Observable at a time
zh_cn: 从所有的 Observable 中发射所有物品，一次一个 Observable

source: and emitting the items from only the most-recently emitted of those Observables
zh_cn: 仅从最近发射的那些 Observables 中发射项

source: and follows the protocol `onSubscribe (onSuccess | onError)?`.
zh_cn: 并遵循协议 `onSubscribe (onSuccess | onError)?`。

source: and for Ivy:
zh_cn: 对于 Ivy：

source: and for Maven:
zh_cn: 对于 Maven：

source: and if the message is sent, its contents.
zh_cn: 如果消息被发送，则要指定其内容。

source: and still follows the protocol `onSubscribe (onComplete | onError)?`.
zh_cn: 并且仍遵循协议 `onSubscribe (onComplete | onError)?`。

source: and then I want to ask it to start
zh_cn: 然后我想要它开始

source: and then emits the complete sequence, even to those who subscribe after the sequence has begun
zh_cn: 然后发射完整的序列，甚至是那些在序列开始后订阅的

source: and then only emits the last item in its sequence
zh_cn: 然后只发射序列中的最后一项

source: applications are in a better position to decide when retransmission is appropriate.
zh_cn: 应用程序可以更好地决定何时重传。

source: apply a function to each item emitted by an Observable, sequentially, and emit each successive value
zh_cn: 将函数应用于 Observable 发射的每个项目，按顺序，并发射每个连续的值（译注：与 Map 区别于函数会使用上一次函数值）

source: apply a function to each item emitted by an Observable, sequentially, and emit the final value
zh_cn: 将函数按顺序应用于 Observable 发射的每个项目，并发射最终值

source: asynchronous
zh_cn: 异步

source: at particular intervals of time
zh_cn: 在特定的时间间隔

source: attach a timestamp to each item emitted by an Observable
zh_cn: 将时间戳附加到 Observable 发射的每个项目

source: authorities: A list of the distinguished names [X501] of acceptable certificate authorities, represented in DER-encoded [X690] format.
zh_cn: authority：可接受的证书颁发机构的专有名称 [X501] 列表，以 DER 编码 [X690] 格式表示。

source: b) bit 6 shall be a zero or a one according to the rules of 8.1.2.5;
zh_cn: b)根据 8.1.2.5 的规则，第 6 位应为零或一；

source: b) bits 7 to 1 shall encode the number of subsequent octets in the length octets, as an unsigned binary integer with bit 7 as the most significant bit;
zh_cn: b)第 7 到 1 应编码长度八位字节中后续八位字节的数目，作为无符号二进制整数，其中第 7 位为最高有效位；

source: b) bits 7 to 1 of the first subsequent octet, followed by bits 7 to 1 of the second subsequent octet, followed in turn by bits 7 to 1 of each further octet, up to and including the last subsequent octet in the identifier octets shall be the encoding of an unsigned binary integer equal to the tag number, with bit 7 of the first subsequent octet as the most significant bit;
zh_cn: b)第一个后续八位字节的第 7 位到第 1 位，然后是第二个后续八位字节的第 7 位到第 1 位，接着是每个另外的八位字节的第 7 位到第 1 位，直到并包括标识符八位字节中的最后一个后续八位字节（的第 7 位到第 1 位），是无符号二进制整数的编码，等于标记号，第一个后续八位字节的第 7 位作为最高有效位；

source: b) the indefinite form (see 8.1.3.6).
zh_cn: b)不确定形式(见 8.1.3.6)。

source: b) use either the definite form (see 8.1.3.3) or the indefinite form (see 8.1.3.6), a sender's option, if the encoding is constructed and all immediately available;
zh_cn: b)使用确定的形式(见 8.1.3.3)或不确定形式(见 8.1.3.6)，根据发送者的选择，如果编码是结构的并且全部立即可用；
